; Скрипт для AutoHotkey 1.1
; ========================================================================

; Необходимые моды
#NoEnv
SendMode Input

; Замена строки: сразу, внтури слов, чувствительна к регистру.
#Hotstring * ? C

; ========================================================================
; То что и так видно на картинке
;

; ё → `
; Ё → ~
::``~::ё
::ёЁ::ё
::~``::Ё
::Ёё::Ё
+sc003::@
; № → #
::3№::№
::3#::№
+sc005::$
+sc007::^
+sc008::&

::йй::ѳ   ; новое ё
::ЙЙ::Ѳ
::Йй::Ѳ
::йЙ::йй
; ц → ж
::цц::ц
::ЦЦ::Ц
::Цц::Ц
::цЦ::жж
::уу::э
::УУ::Э
::Уу::Э
::уУ::уу
::шш::щ
::ШШ::Щ
::Шш::Щ
::шШ::шш
::щ::х     ; Щ → Х
::Щ::Х
::х::[     ; скобки []
::ъ::]
::Х::{{}   ; скобки {}
::Ъ::{}}

; ф → б
::фф::ф
::ФФ::Ф
::Фф::Ф
::фФ::бб
::ыы::ю
::ЫЫ::Ю
::Ыы::Ю
::ыЫ::ыы
::ж::`;
::Ж::`:
; э → '
; Э → "
::'"::°    ; градус
::эЭ::°

::ьь::ъ
::ЬЬ::Ъ
::Ьь::Ъ
::ьЬ::ьь
; б → ,
; Б → <
::,<::«    ; ѳлочки
::бБ::«
; ю → .
; Ю → >
::.>::»    ; ѳлочки
::юЮ::»
sc035::/
+sc035::?
+sc02B::|

::eE::∃    ; сушествует
::еЕ::∃
::aA::∀    ; все
::аА::∀
::sS::∑    ; сумма
::сС::∑


; ========================================================================
; Сочетания кнопок
;
::W-::↑    ; ↑←↓→ WASD
::Ц-::↑
::A-::←
::Ф-::←
::S-::↓
::Ы-::↓
::D-::→
::В-::→
::=-::—    ; тире
::+-::±    ; математика
::=>::⇒
::=Ю::⇒
::<-::≤
::Б-::≤
::>-::≥
::Ю-::≥
::--=::≡
::!!=::≠
::~=::≈
::Ё=::≈

::дз::z    ; японское пасхальное яйцо
::ДЗ::Z
::Дз::Z
::дЗ::дз
::дц::ѫ    ; корейское пасхальное яйцо
::ДЦ::Ѫ
::Дц::Ѫ
::дЦ::дж

; ========================================================================
; Клавишы для сочетаний (должны быть снизу)
; При нажатии на них происходит подмена другой символ, 
; поэтому сочетание из двух подряд не работает просто так.
;

:b0:ё:: 
	Send {BS}
	Send ``
Return
:b0:Ё:: 
	Send {BS}
	Send ~
Return
:b0:№::
	Send {BS}
	Send {#}
Return
:b0:ц:: 
	Send {BS}
	Send ж
Return
:b0:Ц:: 
	Send {BS}
	Send Ж
Return
:b0:ф:: 
	Send {BS}
	Send б
Return
:b0:Ф:: 
	Send {BS}
	Send Б
Return
:b0:э:: 
	Send {BS}
	Send '
Return
:b0:Э:: 
	Send {BS}
	Send "
Return
:b0:б:: 
	Send {BS}
	Send {,}
Return
:b0:Б:: 
	Send {BS}
	Send <
Return
:b0:ю:: 
	Send {BS}
	Send {.}
Return
:b0:Ю:: 
	Send {BS}
	Send >
Return

; ========================================================================
