; ========================================================================
;
; Скрипт для AutoHotkey 1.x  ( http://ahkscript.org/ )
; Автор:     Akela1101 <akela1101@gmail.com>
; Версия:    3.1
; Начало:    2014 год
;
; ========================================================================

; Необходимые моды
#NoEnv
SendMode Input

; Замена строки: сразу, внтури слов, чувствительна к регистру.
#Hotstring * ? C

; ========================================================================
;
::ёё::``    ; грэйв
::ЁЁ::~     ; тильда
::!!::́      ; ударение
::""::@     ; собака
::№№::{#}   ; шарп
::`;`;::$   ; доллар
::%%::°     ; градус
::`::::{^}  ; домик
::??::&     ; амперсанд
::**::'     ; апостоф

::шш::щ
::ШШ::Щ
::Шш::Щ
::щ::х
::Щ::Х
::х::[
::ъ::]
::Х::{{}
::Ъ::{}}
+sc02B::|

::ьь::ъ
::ЬЬ::Ъ
::Ьь::Ъ
::ББ::<
::ЮЮ::>
::,,::/    ; знак деления

; ========================================================================
; Сочетания кнопок
;
::W-::↑    ; ↑←↓→ WASD
::Ц-::↑
::A-::←
::Ф-::←
::S-::↓
::Ы-::↓
::D-::→
::В-::→

::<-::≤
::Б-::≤
::>-::≥
::Ю-::≥
::+-::±
::=-::—    ; тире
::=>::⇒
::=Ю::⇒
::\=::≠
::~=::≈
::Ё=::≈

::дз::z    ; японское пасхальное яйцо
::ДЗ::Z
::дЗ::дз
::дж::ѫ    ; корейское пасхальное яйцо
::ДЖ::Ѫ
::дЖ::дж

::йё::ё    ; ё с точками
::ЙЁ::Ё
::Йё::Ё

; ========================================================================
; Спецыальные клавишы (должны быть снизу)
;
; ::ё::ѳ   ; ё без точек
; ::Ё::Ѳ
;
:b0:ё::
	Send {BS}
	Send ѳ
Return
:b0:Ё::
	Send {BS}
	Send Ѳ
Return
; ========================================================================